function 游戏时间()
{
   if(日 > 30)
   {
      日 = 1;
      月 += 1;
   }
   if(月 > 12)
   {
      月 = 1;
      年 += 1;
      年龄 += 1;
      主面板.年龄.text = 年龄;
   }
   if(星期 > 7)
   {
      星期 = 1;
   }
   if(日期属性 > 5)
   {
      日期属性 = 1;
   }
   if(星期 == 1)
   {
      星期几 = "星期一";
   }
   else if(星期 == 2)
   {
      星期几 = "星期二";
   }
   else if(星期 == 3)
   {
      星期几 = "星期三";
   }
   else if(星期 == 4)
   {
      星期几 = "星期四";
   }
   else if(星期 == 5)
   {
      星期几 = "星期五";
   }
   else if(星期 == 6)
   {
      星期几 = "星期六";
   }
   else if(星期 == 7)
   {
      星期几 = "星期天";
   }
   if(日期属性 == 1)
   {
      日属性 = "属性：金";
   }
   else if(日期属性 == 2)
   {
      日属性 = "属性：木";
   }
   else if(日期属性 == 3)
   {
      日属性 = "属性：水";
   }
   else if(日期属性 == 4)
   {
      日属性 = "属性：火";
   }
   else if(日期属性 == 5)
   {
      日属性 = "属性：土";
   }
   查看随机条件();
   时间.text = "青龙年 " + 年 + "年 " + 月 + "月 " + 日 + "日";
   计算日期 = 年 + "" + 月 + "" + 日;
   计算重要日子 = 月 + "_" + 日;
   星期TXT.text = 星期几;
   日期属性TXT.text = 日属性;
}
function 说话情况()
{
   对话框._visible = true;
   讲几句 = 4;
   头像1 = 2;
   名字1 = 女儿的名字;
   说话1 = "爸爸，早上好。今天一整天都要努力哦。\n(点右边的箭头继续。)";
   头像2 = 72;
   名字2 = "您";
   说话2 = "女儿今天精神充沛的道早安了。\n要是能继续这样健康可爱的成长就好了。\n不过操烦是无穷尽的。";
   头像3 = 72;
   名字3 = "您";
   说话3 = "那么，从现在起会培养出什么样的孩子呢？";
   头像4 = 76;
   名字4 = "亚吉";
   说话4 = "你好！主人。\n我是您新的管家亚吉，专门照顾小姐。\n请问，小姐这个月的行程是怎么安排的?";
   哪句 = 1;
   处理说话();
}
function 处理说话()
{
   主面板._visible = false;
   对话框.头像.gotoAndStop(this["头像" + 哪句]);
   对话框.名字.text = this["名字" + 哪句];
   对话框.说话框.text = this["说话" + 哪句];
   对话框.前.onRelease = function()
   {
      if(哪句 > 1)
      {
         哪句 -= 1;
         处理说话();
      }
   };
   对话框.后.onRelease = function()
   {
      if(哪句 < 讲几句)
      {
         哪句 += 1;
         处理说话();
      }
      else
      {
         更新数值();
         对话框._visible = false;
         主面板._visible = true;
      }
   };
}
function 不跳出处理说话()
{
   attachMovie("对话框","对话框1",230,{_x:92,_y:338});
   对话框1.头像.gotoAndStop(this["头像" + 哪句]);
   对话框1.名字.text = this["名字" + 哪句];
   对话框1.说话框.text = this["说话" + 哪句];
   对话框1.前.onRelease = function()
   {
      if(哪句 > 1)
      {
         哪句 -= 1;
         不跳出处理说话();
      }
   };
   对话框1.后.onRelease = function()
   {
      if(哪句 < 讲几句)
      {
         哪句 += 1;
         不跳出处理说话();
      }
      else
      {
         对话框1.removeMovieClip();
         外出面板.场景.gotoAndStop(7);
         外出面板.按钮._visible = true;
         更新数值();
      }
   };
}
function 显示按钮处理说话()
{
   attachMovie("对话框","对话框1",230,{_x:92,_y:338});
   对话框1.头像.gotoAndStop(this["头像" + 哪句]);
   对话框1.名字.text = this["名字" + 哪句];
   对话框1.说话框.text = this["说话" + 哪句];
   对话框1.前.onRelease = function()
   {
      if(哪句 > 1)
      {
         哪句 -= 1;
         显示按钮处理说话();
      }
   };
   对话框1.后.onRelease = function()
   {
      if(哪句 < 讲几句)
      {
         哪句 += 1;
         显示按钮处理说话();
      }
      else
      {
         对话框1.removeMovieClip();
         外出面板.场景.gotoAndStop(7);
         外出面板.按钮._visible = true;
         外出面板.赌场._visible = false;
         更新数值();
      }
   };
}
function 餐厅处理说话()
{
   attachMovie("对话框","对话框1",230,{_x:92,_y:338});
   对话框1.头像.gotoAndStop(this["头像" + 哪句]);
   对话框1.名字.text = this["名字" + 哪句];
   对话框1.说话框.text = this["说话" + 哪句];
   对话框1.前.onRelease = function()
   {
      if(哪句 > 1)
      {
         哪句 -= 1;
         餐厅处理说话();
      }
   };
   对话框1.后.onRelease = function()
   {
      if(哪句 < 讲几句)
      {
         哪句 += 1;
         餐厅处理说话();
      }
      else
      {
         对话框1.removeMovieClip();
         外出面板.场景.gotoAndStop(7);
         吃饭 = 0;
         外出面板.按钮._visible = true;
         更新数值();
      }
   };
}
function 身材函数()
{
   if(体重 - 110 > 0)
   {
      体重指数 = "胖";
      差值 = (体重 - 110) / 110;
   }
   else
   {
      体重指数 = "瘦";
      差值 = (体重 - 110) * -1 / 110;
   }
   if(体重指数 == "胖")
   {
      胸围 = Math.round(95 * (1 + 差值));
      腰围 = Math.round(80 * (1 + 差值 * 2));
      臀围 = Math.round(97 * (1 + 差值));
   }
   else
   {
      胸围 = Math.round(95 * (1 - 差值));
      腰围 = Math.round(80 * (1 - 差值 * 2));
      臀围 = Math.round(97 * (1 - 差值));
   }
}
function 行程前说话()
{
   if(饮食参数 == 1)
   {
      什么饮食 = "增强体力";
      什么价格 = 60;
      什么体力 = 4;
      什么体重 = 0.6;
   }
   else if(饮食参数 == 2)
   {
      什么饮食 = "普通饮食";
      什么价格 = 45;
      什么体力 = 2;
      什么体重 = 0.3;
   }
   else if(饮食参数 == 3)
   {
      什么饮食 = "节约饮食";
      什么价格 = 30;
      什么体力 = -2;
      if(体重 > 73)
      {
         什么体重 = -0.3;
      }
   }
   else if(饮食参数 == 4)
   {
      什么饮食 = "减肥饮食";
      什么价格 = 15;
      什么体力 = -4;
      if(体重 > 73)
      {
         什么体重 = -0.6;
      }
   }
   对话框._visible = true;
   if(疲劳 - 体力 <= -20)
   {
      对话框.头像.gotoAndStop(76);
      对话框.名字.text = "亚吉";
      对话框.说话框.text = "是，主人。开始执行本月的行程。\n" + 什么饮食 + ":" + 什么价格 + "G的伙食费。";
   }
   else
   {
      对话框.头像.gotoAndStop(78);
      对话框.名字.text = "亚吉";
      对话框.说话框.text = "小姐的身子好象不大舒服。\n" + 什么饮食 + ":" + 什么价格 + "G的伙食费。";
   }
   对话框.前.onRelease = function()
   {
   };
   对话框.后.onRelease = function()
   {
      对话框._visible = false;
      金钱 += 什么价格;
      体重 += 什么体重;
      if(体力 > 90 and 体力 < 999)
      {
         体力 += 什么体力;
      }
      if(体重 >= 78 and 体重 <= 142)
      {
         体重 += 什么体重;
      }
      身高 += 0.2;
      身材函数();
      更新数值();
      执行行程();
   };
}
function 状态()
{
   attachMovie("状态框","状态框",220,{_x:55,_y:20});
}
function 服装()
{
   attachMovie("道具板","道具板",220,{_x:385,_y:66});
}
function 道具()
{
   attachMovie("道具板1","道具板",220,{_x:385,_y:66});
}
function 饮食()
{
   attachMovie("饮食管理","饮食管理",220,{_x:189,_y:146});
}
function 外出()
{
   attachMovie("外出面板","外出面板",220,{_x:103,_y:73});
   野外音乐.stop();
   开场音乐.gotoAndPlay(1);
   游戏音乐.stop();
   工作音乐.stop();
}
function 说话()
{
   attachMovie("说话面板","说话面板",220,{_x:368,_y:53});
}
function 评价()
{
   if(每月评价 == 1)
   {
      交际 += random(10);
      对话框._visible = true;
      讲几句 = 5;
      头像1 = 35;
      名字1 = "路人甲";
      if(声望 < 100)
      {
         说话1 = "默默无闻的女孩子";
      }
      else if(声望 >= 100 and 声望 < 300)
      {
         说话1 = "好象听说过这个姑娘。";
      }
      else if(声望 >= 300 and 声望 < 600)
      {
         说话1 = "原来是骑士" + 父亲的名字 + "的女儿。最近经常听说她的事迹";
      }
      else if(声望 >= 600)
      {
         说话1 = "原来是" + 女儿的名字 + "别看她年纪轻轻，名声远过于她的父亲。" + 父亲的名字 + "男爵。";
      }
      头像2 = 36;
      名字2 = "路人乙";
      if(体重 < 83)
      {
         说话2 = "长得有点瘦。";
      }
      else if(体重 >= 83 and 体重 < 102)
      {
         说话2 = "身材长得挺匀称的。";
      }
      else
      {
         说话2 = "就是长得胖了一点。";
      }
      头像3 = 47;
      名字3 = "路人丙";
      if(魅力 < 100 and 气质 < 100)
      {
         说话3 = "跟城里到处跑的小女生没什么区别。";
      }
      else if(魅力 >= 100 and 魅力 < 300 and 气质 >= 100 and 气质 < 300)
      {
         说话3 = "这女孩子长大以后，感觉漂亮了不少。";
      }
      else if(魅力 >= 300 and 魅力 < 600 and 气质 >= 300 and 气质 < 600)
      {
         说话3 = "这女孩子真漂亮，而且有种说不出来的气质。";
      }
      else
      {
         说话3 = "每次看这个女孩子走在街上，都有种天仙下凡的感觉。";
      }
      头像4 = 50;
      名字4 = "路人丁";
      if(罪孽 < 60)
      {
         说话4 = "听说她一直很乖";
      }
      else if(罪孽 >= 60 and 罪孽 < 150)
      {
         说话4 = "最近好象学坏了。";
      }
      else if(罪孽 >= 150 and 罪孽 < 300)
      {
         说话4 = "不知道" + 父亲的名字 + "是怎么带小孩的，一个女孩子，整天和那些地痞混在一起。";
      }
      else
      {
         说话4 = "嘘~她来了。";
      }
      头像5 = 53;
      名字5 = "路人卯";
      if(腕力 < 100)
      {
         说话5 = "单薄的身子感觉弱不惊风。";
      }
      else if(腕力 >= 100 and 体力 < 腕力)
      {
         说话5 = "虽然看得有点单薄，但是感觉气色不错。";
      }
      else if(腕力 >= 300 and 体力 < 腕力)
      {
         说话5 = "身体看来不错，这体格感觉不比同年的小男生差多少。";
      }
      else
      {
         说话5 = "隐约可以看得到她身上的肌肉，不过女孩子这样好么？";
      }
      哪句 = 1;
      每月评价 = 0;
      处理说话();
   }
   else
   {
      对话框._visible = true;
      讲几句 = 1;
      头像1 = 7;
      名字1 = 女儿的名字;
      说话1 = "这个月已经上街听过了~";
      哪句 = 1;
      处理说话();
   }
}
function 系统()
{
   _root.attachMovie("系统设置","系统设置",220,{_x:55,_y:77});
}
function 行程()
{
   attachMovie("工作框","工作框",220,{_x:55,_y:20});
}
function 更新数值()
{
   金钱TXT1.text = "金钱" + Math.floor(金钱);
   疲劳TXT1.text = "疲劳" + 疲劳;
   声望TXT1.text = "声望" + 声望;
   体力TXT1.text = "体力" + 体力;
}
function 执行行程()
{
   野外音乐.stop();
   开场音乐.stop();
   游戏音乐.stop();
   工作音乐.gotoAndPlay(1);
   场景.gotoAndStop(2);
   场景.确定._visible = false;
   if(所有工作[月工作1].关联 == 0)
   {
      场景.显示.text += 所有工作[月工作1].第一次说;
   }
   if(所有工作[月工作1].关联 < 20)
   {
      随机参数 = 3;
   }
   else if(所有工作[月工作1].关联 > 155)
   {
      随机参数 = 9;
   }
   else
   {
      随机参数 = 5;
   }
   if(所有工作[月工作1].关联 <= 40)
   {
      工作等级 = 1;
      提示等级 = "初级";
   }
   else if(所有工作[月工作1].关联 > 40 and 所有工作[月工作1].关联 <= 155)
   {
      工作等级 = 1.3;
      提示等级 = "中级";
   }
   else if(所有工作[月工作1].关联 > 155 and 所有工作[月工作1].关联 <= 400)
   {
      工作等级 = 1.6;
      提示等级 = "高级";
   }
   else
   {
      工作等级 = 1.9;
      提示等级 = "专家";
   }
   判断升级变化(月工作1);
   数值 = 1;
   第一轮 = setInterval(第一个十天,游戏速度);
}
function 启动第一个()
{
   第一轮 = setInterval(第一个十天,游戏速度);
}
function 启动第二个()
{
   第二轮 = setInterval(第二个十天,游戏速度);
}
function 启动第三个()
{
   第三轮 = setInterval(第三个十天,游戏速度);
}
function 接着干活()
{
   if(发送值1 == "十天")
   {
      启动第一个();
   }
   else if(发送值1 == "二十天")
   {
      启动第二个();
   }
   else if(发送值1 == "三十天")
   {
      启动第三个();
   }
}
function 处理空挡函数()
{
   trace("月工作1" + 月工作1);
   if(记录当月状态参数 == 月工作1)
   {
      trace("月工作1" + 月工作1);
      trace("有没有执行");
      月工作1 = 27;
      第一轮 = setInterval(第一个十天,游戏速度);
   }
   else if(记录当月状态参数 == 月工作2)
   {
      月工作2 = 27;
      第二轮 = setInterval(第二个十天,游戏速度);
   }
   else if(记录当月状态参数 == 月工作3)
   {
      月工作3 = 27;
      第三轮 = setInterval(第三个十天,游戏速度);
   }
}
function 第一个十天()
{
   游戏时间();
   计算特殊日子();
   查看是否升级();
   if(事件触发 == 0)
   {
      if(日 <= 10)
      {
         if(所有工作[月工作1].类型 !== "冒险" and 所有工作[月工作1].类型 !== "旅游")
         {
            执行每个月(月工作1);
            日++;
            星期++;
            日期属性++;
         }
         else if(生病状态 !== 1)
         {
            记录当月状态参数 = 月工作1;
            clearInterval(第一轮);
            clearInterval(第二轮);
            clearInterval(第三轮);
            if(所有工作[月工作1].类型 == "冒险")
            {
               attachMovie("战斗系统","战斗系统",220,{_x:0,_y:0});
            }
            else if(所有工作[月工作1].类型 == "旅游")
            {
               度假系统();
            }
         }
         else
         {
            月工作1 = 28;
            第一个十天();
         }
      }
      else
      {
         if(所有工作[月工作2].关联 == 0)
         {
            场景.显示.text += 所有工作[月工作2].第一次说;
         }
         if(所有工作[月工作2].关联 < 20)
         {
            随机参数 = 3;
         }
         else if(所有工作[月工作2].关联 > 155)
         {
            随机参数 = 9;
         }
         else
         {
            随机参数 = 5;
         }
         if(所有工作[月工作2].关联 <= 40)
         {
            工作等级 = 1;
            提示等级 = "初级";
         }
         else if(所有工作[月工作2].关联 > 40 and 所有工作[月工作2].关联 <= 155)
         {
            工作等级 = 1.3;
            提示等级 = "中级";
         }
         else if(所有工作[月工作2].关联 > 155 and 所有工作[月工作2].关联 <= 400)
         {
            工作等级 = 1.6;
            提示等级 = "高级";
         }
         else
         {
            工作等级 = 1.9;
            提示等级 = "专家";
         }
         判断升级变化(月工作2);
         第二轮 = setInterval(第二个十天,游戏速度);
         clearInterval(第一轮);
      }
   }
   else
   {
      clearInterval(第一轮);
      发送值1 = "十天";
   }
}
function 第二个十天()
{
   游戏时间();
   计算特殊日子();
   if(事件触发 == 0)
   {
      if(日 <= 20)
      {
         if(所有工作[月工作2].类型 !== "冒险" and 所有工作[月工作2].类型 !== "旅游")
         {
            执行每个月(月工作2);
            日++;
            星期++;
            日期属性++;
         }
         else if(生病状态 !== 1)
         {
            记录当月状态参数 = 月工作2;
            clearInterval(第一轮);
            clearInterval(第二轮);
            clearInterval(第三轮);
            if(所有工作[月工作2].类型 == "冒险")
            {
               attachMovie("战斗系统","战斗系统",220,{_x:0,_y:0});
            }
            else if(所有工作[月工作2].类型 == "旅游")
            {
               度假系统();
            }
         }
         else
         {
            月工作2 = 28;
            第二个十天();
         }
      }
      else
      {
         if(所有工作[月工作3].关联 == 0)
         {
            场景.显示.text += 所有工作[月工作3].第一次说;
         }
         if(所有工作[月工作3].关联 < 20)
         {
            随机参数 = 3;
         }
         else if(所有工作[月工作3].关联 > 155)
         {
            随机参数 = 9;
         }
         else
         {
            随机参数 = 5;
         }
         if(所有工作[月工作3].关联 <= 40)
         {
            工作等级 = 1;
            提示等级 = "初级";
         }
         else if(所有工作[月工作3].关联 > 40 and 所有工作[月工作3].关联 <= 155)
         {
            工作等级 = 1.3;
            提示等级 = "中级";
         }
         else if(所有工作[月工作3].关联 > 155 and 所有工作[月工作3].关联 <= 400)
         {
            工作等级 = 1.6;
            提示等级 = "高级";
         }
         else
         {
            工作等级 = 1.9;
            提示等级 = "专家";
         }
         判断升级变化(月工作3);
         数值 = 1;
         第三轮 = setInterval(第三个十天,游戏速度);
         clearInterval(第二轮);
      }
   }
   else
   {
      clearInterval(第二轮);
      发送值1 = "二十天";
   }
}
function 判断升级变化(对象)
{
   this["等级" + 对象] = 工作等级;
   switch(this["目标" + 对象])
   {
      default:
         工作升级了 = 1;
         发送工作项目 = 对象;
         trace("升级了");
      case undefined:
      case this["等级" + 对象]:
         return;
   }
}
function 查看是否升级()
{
   if(工作升级了 == 1)
   {
      事件触发 = 1;
      是否出现选择 = 0;
      跳哪 = 1;
      讲几句 = 3;
      头像1 = 2;
      名字1 = 女儿的名字;
      if(所有工作[发送工作项目].类型 == "工作")
      {
         说话1 = "爸爸~老板说我做得好，工作升级了。以后薪水会多一点。";
      }
      else
      {
         说话1 = "爸爸~老师说我学习成绩不错，课程等级提升了。不过就是学费过了一些。";
      }
      头像2 = 72;
      名字2 = "您";
      说话2 = 女儿的名字 + "很棒呢。\n要继续加油哦。";
      头像3 = 2;
      名字3 = 女儿的名字;
      说话3 = "嗯!";
      哪句 = 1;
      工作升级了 = 0;
      处理执行行程();
   }
}
function 第三个十天()
{
   游戏时间();
   计算特殊日子();
   if(事件触发 == 0)
   {
      if(日 <= 30 and 日 > 18)
      {
         if(所有工作[月工作3].类型 !== "冒险" and 所有工作[月工作3].类型 !== "旅游")
         {
            执行每个月(月工作3);
            日++;
            星期++;
            日期属性++;
         }
         else if(生病状态 !== 1)
         {
            记录当月状态参数 = 月工作3;
            clearInterval(第一轮);
            clearInterval(第二轮);
            clearInterval(第三轮);
            if(所有工作[月工作3].类型 == "冒险")
            {
               attachMovie("战斗系统","战斗系统",220,{_x:0,_y:0});
            }
            else if(所有工作[月工作3].类型 == "旅游")
            {
               度假系统();
            }
         }
         else
         {
            月工作3 = 28;
            第三个十天();
         }
      }
      else
      {
         clearInterval(第三轮);
         场景.确定._visible = true;
         trace("过了一个月");
      }
   }
   else
   {
      trace("有没有扫描");
      clearInterval(第三轮);
      发送值1 = "三十天";
   }
}
function 执行结束()
{
   主面板._visible = true;
   吃饭 = 1;
   皇宫次数 = 1;
   每月评价 = 1;
   上个月 = 这个月;
   每月谈话 = 1;
   这个月 = 年;
   if(月 <= 3)
   {
      背景1.gotoAndStop(1);
   }
   else if(月 > 3 and 月 <= 6)
   {
      背景1.gotoAndStop(2);
   }
   else if(月 > 6 and 月 <= 9)
   {
      背景1.gotoAndStop(3);
   }
   else if(月 > 9)
   {
      背景1.gotoAndStop(4);
   }
   if(上个月 == 1765 and 这个月 == 1766)
   {
      长大了图片.play();
      女儿人物.gotoAndStop(2);
      女儿人物.人.gotoAndStop(衣服);
   }
   else if(上个月 == 1767 and 这个月 == 1768)
   {
      长大了图片.play();
      女儿人物.gotoAndStop(3);
      女儿人物.人.gotoAndStop(衣服);
   }
   else if(上个月 == 1769 and 这个月 == 1770)
   {
      长大了图片.play();
      游戏状况 = 1;
      "游戏结束";
   }
   负数变量 = -1500;
   if(金钱 < 负数变量)
   {
      游戏状况 = 1;
      trace("赶出城结局");
      结局事件 = 1;
   }
   if(生病天数 > 180)
   {
      游戏状况 = 1;
      trace("生病孩子被要回");
      结局事件 = 2;
   }
   主面板.更新();
   if(生病状态 == 1)
   {
      女儿人物.表情.gotoAndStop(1);
   }
   else
   {
      女儿人物.表情.gotoAndStop(random(2) + 1);
   }
   trace("处理事件");
   if(游戏状况 == 0)
   {
      trace("有处理事件");
      trace(计算日期);
      处理事件();
   }
   else
   {
      野外音乐.stop();
      开场音乐.stop();
      游戏音乐.stop();
      工作音乐.stop();
      主面板._visible = false;
      if(结局事件 == undefined)
      {
         结局事件 = 3;
      }
      attachMovie("结局","结局",223,{_x:0,_y:0});
   }
}
stop();
游戏时间();
吃饭 = 1;
事件触发 = 0;
每月评价 = 1;
工作升级了 = 0;
每月谈话 = 1;
选择框.swapDepths(220);
游戏速度 = 250;
游戏状况 = 0;
对话框._visible = false;
主面板._visible = false;
说话情况();
身材函数();
更新数值();
工作等级 = "";
// [存档补丁] 跳过开场对话直接显示主菜单
对话框._visible = false;
主面板._visible = true;
